# ==========================================================
# 課程名稱：程式設計 Python 
# 作業編號：HW03
# 學生姓名：陳登翔 
# 學號：11450062A
# 撰寫日期：2026-05-21
# 程式功能簡述：樂透開獎主程式
# ==========================================================

#使用「import 樂透模組」匯入模組進行開獎
from 樂透模組 import exlotto

def main():
    # 產生 1 到 48 個數字中取 6 個數字的中獎號碼
    n = 48
    m = 6
    winning_numbers = exlotto.lotto(n, m)
    
    # 將中獎號碼由小到大進行排序
    winning_numbers.sort()
    
    # 顯示結果
    print("預覽結果")
    print(winning_numbers)

if __name__ == "__main__":
    main()

